In [29]:
import pandas as pd
 #1) Importe o arquivo alunos.csv e armazene seu conteúdo  em um DataFrame pandas.
pd.read_csv('dataset/dados.csv')

url = pd.read_csv('dataset/dados.csv')

type(url)

pandas.core.frame.DataFrame

In [28]:
#2) Visualize as primeiras 7 linhas do DataFrame e as 5 últimas
url.head(7)

    Nome  Idade  Notas  Aprovado
0    Ary     20    7.5      True
1    Ana     18    NaN     False
2  Cátia     27    2.5     False
3  Denis     18    5.0     False
4   Beto     21   10.0      True
5  Bruna     23    NaN     False
6   Dara     21    7.0      True

In [30]:
#2) Visualize as primeiras 7 linhas do DataFrame e as 5 últimas
url.tail(5)

      Nome  Idade  Notas  Aprovado
13   Mirla     25    9.0      True
14   Paulo     37    NaN     False
15  Mylena     29    7.0      True
16   Lucas     33    NaN     False
17   Nadia     34    8.0      True

In [33]:
#3) Confira a quantidade linhas e colunas desse DataFrame
url.shape

(18, 4)

In [34]:
#4) Explore as colunas do DataFrame e analise  os tipos dos dados presentes em cada coluna.
url.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Nome      18 non-null     object
 1   Idade     18 non-null     int64
 2   Notas     12 non-null     float64
 3   Aprovado  18 non-null     bool
dtypes: bool(1), float64(1), int64(1), object(1)
memory usage: 582.0+ bytes